function robt = abbrt(E, T, tool_l, tool_h, tool_y, tool_a, ql)
%--------------------------创建robtarget坐标-------------------------------
%坐标是在世界坐标下的，所以采用世界坐标下的机械臂的末端位置信息
for i = 1:3
    rp(i) = E(i,4)*1000;
end
%********************************end**************************************

%-------------------------创建robtarget四元数------------------------------
%这里的四元数是相对世界坐标的，所以要用世界坐标下的机械臂的末端位置阵信息
for i = 1:3
    for j = 1:3
        R(i,j) = E(i,j);
    end
end
rq = rot2quat(R);
%********************************end**************************************

%-------------------------创建robtarget轴配置------------------------------
%求八组可能的逆解
Q = ikabb(T, tool_l, tool_h, tool_y, tool_a);
%求最佳解
qi = ikbest(ql,Q);
%求轴配置
rcf = rscfx(qi);
%********************************end**************************************

%-------------------------创建robtarget外轴值------------------------------
rex = [9E+09,9E+09,9E+09,9E+09,9E+09,9E+09];
%********************************end**************************************

%-------------------------创建robtarget输出------------------------------
robt = struct('rp',rp,'rq',rq,'rcf',rcf,'rex',rex,'qi',qi,'sing',0,'pot',0);
%********************************end*************************************